run/mooredBoxInRegularWaves/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     floatStepper;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         20;

deltaT          0.0001;

writeControl    adjustable;

writeInterval   0.25;

purgeWrite      0;

writeFormat     binary;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5;
maxAlphaCo      0.5;
maxDeltaT       1;

libs
( 
    "libwaveGeneration.so"
    "libwaveAbsorption.so"
    "libsampling.so"
    "libfieldFunctionObjects.so"
    "librigidBodyMotion.so" 
    "libmoordyn.so" 
);


functions
{
   floaterMotion
    {
        type           floaterStateWriter;
        libs           (floaterStateWriter);
        writeControl    timeStep;
        writeInterval   1;
        bodyName        box;
    }
}

// ************************************************************************* //


// ************************************************************************* //
